#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-eKbtpatMLT5dK5mz

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.storybook.aws_s3_bucket.main: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate: Refreshing state... [id=prod/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=prod/application-secret]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.module.content.kubernetes_secret.spark_s3_creds: Refreshing state... [id=content/spark-s3-creds]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=prod/elasticsearch-credentials]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.kubernetes_ingress.prod_ingress: Refreshing state... [id=prod/foreign-language-reader-ingress]
module.infrastructure.module.monitoring.kubernetes_namespace.logging: Refreshing state... [id=logging]
module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]
module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126962116]
module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1RVJJFB4SD5MG]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.storybook.digitalocean_record.subdomain: Refreshing state... [id=127348002]
module.infrastructure.module.storybook.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/storybook.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy: Refreshing state... [id=storybook.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.infrastructure.module.content.kubernetes_secret.spark_config will be created
  + resource "kubernetes_secret" "spark_config" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "spark-config"
          + namespace        = "content"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.content.kubernetes_secret.spark_s3_creds will be destroyed
  - resource "kubernetes_secret" "spark_s3_creds" {
      - data = (sensitive value)
      - id   = "content/spark-s3-creds" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "spark-s3-creds" -> null
          - namespace        = "content" -> null
          - resource_version = "838852" -> null
          - self_link        = "/api/v1/namespaces/content/secrets/spark-s3-creds" -> null
          - uid              = "66a78431-e234-46dd-82c7-c06be3fef320" -> null
        }
    }

  # module.infrastructure.module.content.random_password.elasticsearch_password will be created
  + resource "random_password" "elasticsearch_password" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.infrastructure.module.content.random_password.truststore_password will be created
  + resource "random_password" "truststore_password" {
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
